data = [
 {'날짜': '2025-07-01', '지출금액': 12000, '카테고리': '식비', '상세내역': '점심'},
 {'날짜': '2025-07-02', '지출금액': 8000, '카테고리': '교통', '상세내역': '버스'},
 {'날짜': '2025-07-03', '지출금액': 15000, '카테고리': '식비', '상세내역': '저녁'},
]

while True:
    print("=== 지출관리 ====")
    print(" 1. 카테고리 목록 보기")
    print(" 2. 카테고리별 지출 조회")
    print(" 3. 종료")

    n=int(input("선택하세요 ^_^ㅋ:"))

    if n==1:
        print("[카테고리목록]")
        print(" - 간식 ")
        print(" - 교통 ")
        print(" - 식비 ")
    elif n==2:
        category=input("카테고리명:")
        total=0
        for i in data:
            if i['카테고리'] == category:
                total +=i['지출금액']
        print(f"{category}의 지출금액은 {total:,}원입니다..... ㅋ")
    elif n==3:
        break
    else:
        print(f'숫자 좀 잘 봐봐..')
